/*
للحصول علي معلومات المنتجات كاملة بالإضافة الي معلومات القسم المرتبط بالمنتج قمنا بعمل جدول افتراضي لتسهيل العملية عبارة عن 
دمج لجدول المنتجات مع جدول الاقسام بنائا علي الفورن كي اي العلاقية بين الاي دي الخاص بالقسم وكولمن الربط في جدول المنتجات
بدلا من جدول المنتجات API ثم سنستخدم هذا الجدول في ال 
*/

CREATE OR REPLACE VIEW itemsview AS 
SELECT items.*, categories.* FROM  items
INNER JOIN categories on items.items_cat =categories.categories_id

//  ==============================================================
